app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "7TF1Jot08RRdWjwZ7RJkRg"], ["updated_at", "2019-01-31 05:07:36.265864"], ["id", 1]]

  def self.find_by_credentials(username, password)
    user = User.find_by(user_name: username)
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "a"], ["LIMIT", 1]]